Titanic Dataset

1. Clean data
2. Preprare data
3. Create model
4. Train model
5. ???
6. Profit

In [201]:
import pandas as pd 

titanic_path = '../../titanic/train.csv'

df = pd.read_csv(titanic_path, quotechar='"')

In [202]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Keep only desired rows and rearrange for easier view:

In [205]:
preferredOrder = ['Sex', 'Pclass', 'Cabin', 'Embarked', 'SibSp', 'Parch', 'Age', 'Fare', 'Survived']
df = df[preferredOrder]

In [206]:
df.head(5)

      Sex  Pclass Cabin Embarked  SibSp  Parch   Age     Fare  Survived
0    male       3   NaN        S      1      0  22.0   7.2500         0
1  female       1   C85        C      1      0  38.0  71.2833         1
2  female       3   NaN        S      0      0  26.0   7.9250         1
3  female       1  C123        S      1      0  35.0  53.1000         1
4    male       3   NaN        S      0      0  35.0   8.0500         0

Clean up `Cabin`

In [207]:
df['Cabin'].values[:20]

array([nan, 'C85', nan, 'C123', nan, nan, 'E46', nan, nan, nan, 'G6',
       'C103', nan, nan, nan, nan, nan, nan, nan, nan], dtype=object)

In [208]:
def cleanCabin(el):
    if isinstance(el, str):
        return el[:1]
    else:
        return '0'
df['Cabin'] = df['Cabin'].apply(cleanCabin)
df['Cabin'].values[:20]

array(['0', 'C', '0', 'C', '0', '0', 'E', '0', '0', '0', 'G', 'C', '0',
       '0', '0', '0', '0', '0', '0', '0'], dtype=object)

In [209]:
df.head(5)

      Sex  Pclass Cabin Embarked  SibSp  Parch   Age     Fare  Survived
0    male       3     0        S      1      0  22.0   7.2500         0
1  female       1     C        C      1      0  38.0  71.2833         1
2  female       3     0        S      0      0  26.0   7.9250         1
3  female       1     C        S      1      0  35.0  53.1000         1
4    male       3     0        S      0      0  35.0   8.0500         0

We will use these 5 as categories:
 - Pclass
 - Sex
 - Parch
 - Cabin
 - Embarked

We will use these 4 as numbers:
 - Age
 - SibSp (# of **sib**lings / # of **sp**ouses)
 - Parch (# of **par**ent / # of **ch**ildren)
 - Fare

In [210]:
cols_to_normalize = ['Age', 'SibSp', 'Parch', 'Fare']

In [211]:
def normalize(x, colMax):
    if isinstance(x, float):
        return x / colMax
    elif isinstance(x, int):
        return float(x) / colMax
    else:
        return 0

In [212]:
def applyNormalize(col):
    print(col)
    colMax = df[col].max()

    df[col] = df[col].apply(normalize, args=(colMax,))[:5]

In [213]:
for col in cols_to_normalize:
    applyNormalize(col)

Age
SibSp
Parch
Fare

In [214]:
df.head(5)

      Sex  Pclass Cabin Embarked  SibSp  Parch     Age      Fare  Survived
0    male       3     0        S  0.125    0.0  0.2750  0.014151         0
1  female       1     C        C  0.125    0.0  0.4750  0.139136         1
2  female       3     0        S  0.000    0.0  0.3250  0.015469         1
3  female       1     C        S  0.125    0.0  0.4375  0.103644         1
4    male       3     0        S  0.000    0.0  0.4375  0.015713         0

In [215]:
df.describe()

           Pclass     SibSp  Parch       Age      Fare    Survived
count  891.000000  5.000000    5.0  5.000000  5.000000  891.000000
mean     2.308642  0.075000    0.0  0.390000  0.057622    0.383838
std      0.836071  0.068465    0.0  0.085422  0.059552    0.486592
min      1.000000  0.000000    0.0  0.275000  0.014151    0.000000
25%      2.000000  0.000000    0.0  0.325000  0.015469    0.000000
50%      3.000000  0.125000    0.0  0.437500  0.015713    0.000000
75%      3.000000  0.125000    0.0  0.437500  0.103644    1.000000
max      3.000000  0.125000    0.0  0.475000  0.139136    1.000000